/*-------------------------------------------------------------------
  DTO описує API (JSON), а Entity описує вже об'єкти нашого клієнта (застосунку)
Це зрозумілі для нас дані (об'єкти), з якими нам зручно працювати. 

  Об'єкти класу ActiveAlert — це внутрішня модель для карти, яка виконує лише 1 
задачу: говорить нам, в якому регіоні є повітряна тривога.
-------------------------------------------------------------------*/

import 'package:ukraine_alerts/features/alerts/data/entities/region.dart';

class ActiveAlert {
  const ActiveAlert({required this.region});

  final Region region;
}
