// Дякую за наданий код)) Я зрозумів, що таке "складний enum"

enum Region {
  khmelnytskyi(3, 'Хмельницька область'),
  vinnytsia(4, 'Вінницька область'),
  rivne(5, 'Рівненська область'),
  volyn(8, 'Волинська область'),
  dnipropetrovsk(9, 'Дніпропетровська область'),
  zhytomyr(10, 'Житомирська область'),
  zakarpattia(11, 'Закарпатська область'),
  zaporizhzhia(12, 'Запорізька область'),
  ivanoFrankivsk(13, 'Івано-Франківська область'),
  kyivRegion(14, 'Київська область'),
  kirovohrad(15, 'Кіровоградська область'),
  luhansk(16, 'Луганська область'),
  mykolaiv(17, 'Миколаївська область'),
  odesa(18, 'Одеська область'),
  poltava(19, 'Полтавська область'),
  sumy(20, 'Сумська область'),
  ternopil(21, 'Тернопільська область'),
  kharkiv(22, 'Харківська область'),
  kherson(23, 'Херсонська область'),
  cherkasy(24, 'Черкаська область'),
  chernihiv(25, 'Чернігівська область'),
  chernivtsi(26, 'Чернівецька область'),
  lviv(27, 'Львівська область'),
  donetsk(28, 'Донецька область'),
  crimea(29, 'Автономна Республіка Крим'),
  sevastopol(30, 'м. Севастополь'),
  kyivCity(31, 'м. Київ')
  ;

  const Region(this.uid, this.label);

  final int uid;
  final String label;
}
