
// Дякую за наданий код)) Я зрозумів, що таке "складний enum"

/*-----------------------------------------------------------------------------
    Region є розширеним enum, який описує всі регіони, доступні
  користувачеві в застосунку.

  Кожне значення зберігає:

  - uid — числовий ідентифікатор регіону з документації Alerts API,
    який використовується для запиту статусу конкретного регіону;
  - label — людинозрозумілу назву для DropdownMenu, списків та інших
    елементів інтерфейсу.

    Крім власних полів, кожне значення enum має стандартну властивість
  name. Вона використовується у presentation-шарі для формування шляху
  до PNG-overlay, наприклад:

    Region.cherkasy.name → cherkasy → assets/images/map/overlays/cherkasy.png.  
-----------------------------------------------------------------------------*/

enum Region {
  khmelnytskyi(3, 'Хмельницька область'),
  vinnytsia(4, 'Вінницька область'),
  rivne(5, 'Рівненська область'),
  volyn(8, 'Волинська область'),
  dnipropetrovsk(9, 'Дніпропетровська область'),
  zhytomyr(10, 'Житомирська область'),
  zakarpattia(11, 'Закарпатська область'),
  zaporizhzhia(12, 'Запорізька область'),
  ivanoFrankivsk(13, 'Івано-Франківська область'),
  kyivRegion(14, 'Київська область'),
  kirovohrad(15, 'Кіровоградська область'),
  luhansk(16, 'Луганська область'),
  mykolaiv(17, 'Миколаївська область'),
  odesa(18, 'Одеська область'),
  poltava(19, 'Полтавська область'),
  sumy(20, 'Сумська область'),
  ternopil(21, 'Тернопільська область'),
  kharkiv(22, 'Харківська область'),
  kherson(23, 'Херсонська область'),
  cherkasy(24, 'Черкаська область'),
  chernihiv(25, 'Чернігівська область'),
  chernivtsi(26, 'Чернівецька область'),
  lviv(27, 'Львівська область'),
  donetsk(28, 'Донецька область'),
  crimea(29, 'Автономна Республіка Крим'),
  sevastopol(30, 'м. Севастополь'),
  kyivCity(31, 'м. Київ')
  ;

  const Region(this.uid, this.label);

  final int uid;
  final String label;
}
